app/Controllers/Home.php

      public function agregarDato()
     {
     $datosRecibidos = $this->request->getJSON(true);
     // Lógica para insertar los datos en la base de datos
     $conexion = \Config\Database::connect();
     $conexion->table('marca_celulares')->set($datosRecibidos)->insert();
---
INSERT INTO `marca_celulares` (`id`, `marca`, `procesador`, `costo`, `almacenamiento`, `sistema_operativo`) VALUES ('35', 'LG', 'Snapdragon', '500', '128', 'Android')

      public function actualizarDato($id)
     {
     $datosRecibidos = $this->request->getJSON(true); // Recopilar la información proporcionada en la solicitud POST.
     $conexion = \Config\Database::connect();
     $conexion->table('marca_celulares')->set($datosRecibidos)->where('id', $id)->update();
---
UPDATE `marca_celulares` SET `id` = '35', `marca` = 'LG', `procesador` = 'Snapdragon', `costo` = '500', `almacenamiento` = '128', `sistema_operativo` = 'Android'
WHERE `id` = '35'

     public function eliminar($id)
      {
     $conexion = \Config\Database::connect();


     $conexion->table('marca_celulares')->where('id', $id)->delete();
---
DELETE FROM `marca_celulares`
WHERE `id` = '35'